JayHeng/imxrt-flexspi-mem-fw/devices/MIMXRT1189/mcuxpresso/startup_mimxrt1189_cm33.c
WEAK void USB_OTG2_IRQHandler(void)
{   USB_OTG2_DriverIRQHandler();
}

WEAK void USB_OTG1_IRQHandler(void)
{   USB_OTG1_DriverIRQHandler();
}

WEAK void XSPI_SLV_IRQHandler(void)
{   XSPI_SLV_DriverIRQHandler();
}

WEAK void NETC_IRQHandler(void)
{   NETC_DriverIRQHandler();
}

WEAK void MSGINTR1_IRQHandler(void)
{   MSGINTR1_DriverIRQHandler();
}

WEAK void MSGINTR2_IRQHandler(void)
{   MSGINTR2_DriverIRQHandler();
}

WEAK void MSGINTR3_IRQHandler(void)
{   MSGINTR3_DriverIRQHandler();
}

WEAK void MSGINTR4_IRQHandler(void)
{   MSGINTR4_DriverIRQHandler();
}

WEAK void MSGINTR5_IRQHandler(void)
{   MSGINTR5_DriverIRQHandler();
}

WEAK void MSGINTR6_IRQHandler(void)
{   MSGINTR6_DriverIRQHandler();
}

WEAK void SINC1_0_IRQHandler(void)
{   SINC1_0_DriverIRQHandler();
}

WEAK void SINC1_1_IRQHandler(void)
{   SINC1_1_DriverIRQHandler();
}

WEAK void SINC1_2_IRQHandler(void)
{   SINC1_2_DriverIRQHandler();
}

WEAK void SINC1_3_IRQHandler(void)
{   SINC1_3_DriverIRQHandler();
}

WEAK void SINC2_0_IRQHandler(void)
{   SINC2_0_DriverIRQHandler();
}

WEAK void SINC2_1_IRQHandler(void)
{   SINC2_1_DriverIRQHandler();
}

WEAK void SINC2_2_IRQHandler(void)
{   SINC2_2_DriverIRQHandler();
}

WEAK void SINC2_3_IRQHandler(void)
{   SINC2_3_DriverIRQHandler();
}

WEAK void GPIO4_0_IRQHandler(void)
{   GPIO4_0_DriverIRQHandler();
}

WEAK void GPIO4_1_IRQHandler(void)
{   GPIO4_1_DriverIRQHandler();
}

WEAK void GPIO5_0_IRQHandler(void)
{   GPIO5_0_DriverIRQHandler();
}

WEAK void GPIO5_1_IRQHandler(void)
{   GPIO5_1_DriverIRQHandler();
}

WEAK void GPIO6_0_IRQHandler(void)
{   GPIO6_0_DriverIRQHandler();
}

WEAK void GPIO6_1_IRQHandler(void)
{   GPIO6_1_DriverIRQHandler();
}

WEAK void ECAT_IRQHandler(void)
{   ECAT_DriverIRQHandler();
}

//*****************************************************************************

#if defined (DEBUG)
#pragma GCC pop_options
#endif // (DEBUG)
